## Lab Assignment - Oscar Chivers

### Student ID - 190012624

URL: https://github.com/OscarChivers/PY4SA23_Assignment

### Python Basics Code

Task 1: Create an If...Else statement that will test whether a number is divisible by three. "YOUR
VALUE is divisible by 3" should be printed if the value is divisible by three. "YOUR VALUE is not
divisible by three" should be printed if it is not divisible by three. Test the statement on a numeric
variable. Upper case text in the print statement should be replaced with the tested number.

In [3]:
num = int(input("Enter your number: "))

if num%3 == 0:
    print(num,"is divisible by 3")

else: 
    
    print(num,"is not divisible by 3")

Enter your number:  342

342 is divisible by 3

Task 2: Create an If...Else statement that will test whether a type of fruit, represented as a text string,
is in a list of acceptable fruits (apple, orange, pear, kiwi, or strawberry). If the fruit is on the list, the
following should be printed: "YOUR FRUIT is acceptable." If not, then the following should be
printed: "YOUR FRUIT is not acceptable." Upper case text in the print statement should be replaced
with the tested fruit.

In [4]:
fruit_list = ["apple", "orange", "pear", "kiwi", "strawberry"]

fruit = input("Enter your fruit: ")

if fruit in fruit_list:
    print(fruit, "is acceptable")
    
else:
    print(fruit, "is not acceptable")

Enter your fruit:  blue

blue is not acceptable

Task 3: Create a function to calculate the distance between two coordinates using the haversine
formula. Write the following formula where the input parameters are a pair of coordinates as two
lists.

In [5]:
import math 
import numpy as np

def haversine(lat1, lon1, lat2, lon2):
    lat1 = math.radians(lat1)
    lon1 = math.radians(lon1)
    lat2 = math.radians(lat2)
    lon2 = math.radians(lon2)
    
    a = math.sin((lat2 - lat1)/2)**2 + math.cos(lat1) * math.cos(lat2) * math.sin((lon2 - lon1)/2)**2
    
    c = 2 * math.atan2(math.sqrt(a), math.sqrt(1 - a))
    
    R = 6371
    
    return c*R

z = haversine(56.3, 2.8, 51.5, 0.1)
print(z, "km")

#having issue with radians section solved it through chat gpt so maybe have a look at magnus'
# also i have put in my coordinates rather than having put them in 
#also have a look at the one with the

562.1736585422972 km

Going on to the next task, loading in the data with information about the trees in city parks

In [6]:
import numpy as np
import pandas as pd

In [8]:
trees_df = pd.read_csv("Assignment 2 Data/portland_park_trees.csv", sep=",", header=0, encoding="ISO-8859-1")
trees_df.head()

,fid,OBJECTID,Inventory_,Species,DBH,Condition,TreeHeight,CrownWidth,CrownWid_1,CollectedB,...,Genus,Common_nam,Genus_spec,Functional,Size,Native,Edible,Nuisance,Origin,Species_fa
0,1,426,2017/05/09,PSME,37.4,Fair,105.0,44.0,57.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...
1,2,427,2017/05/09,PSME,32.5,Fair,94.0,49.0,45.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...
2,3,428,2017/05/09,CRLA,9.7,Fair,23.0,28.0,27.0,staff,...,Crataegus,Lavalle hawthorn,Crataegus x lavalleei,BD,S,No,NaN,NaN,North America - a hybrid between a Mexican and...,"Like most hawthorns, the tree has stout thorns..."
3,4,429,2017/05/09,QURU,10.3,Poor,28.0,38.0,31.0,staff,...,Quercus,northern red oak,Quercus rubra,BD,L,No,NaN,NaN,North America - eastern Canada and eastern USA...,Acorns take two years to mature and are an imp...
4,5,430,2017/05/09,PSME,33.2,Fair,102.0,43.0,44.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...

Question 1: How many trees are of the Quercus or Acer genus?

In [58]:
subset_genus = trees_df.query('Genus == "Quercus" or Genus == "Acer"')
print(len(subset_genus))
print("")
print("There are", (len(subset_genus)), "of the Quercus or Acer genus")

5675

There are 5675 of the Quercus or Acer genus

Q2: How many trees are of the Quercus or Acer genus and have a DBH larger than 50 inches?

In [28]:
DBH_query = subset_genus.query('DBH > 50')
print(len(DBH_query))
print("")
print("There are", len(DBH_query), "of the Quercus or Acer genus with a DBH larger than 50 inches")

124

There are 124 of the Quercus or Acer genus with a DBH larger than 50 inches

Q3: Which genus has the highest mean DBH of the following genera: Quercus, Acer, or Fraxinus?

In [38]:
trees_df.columns = [column.replace(" ", "_") for column in trees_df.columns]
trees_stats = pd.DataFrame()
trees_stats["Mean"] = trees_df.groupby("Genus")['DBH'].mean()

print(trees_stats.loc["Quercus"])
print("")
print(trees_stats.loc["Acer"])
print("")
print(trees_stats.loc["Fraxinus"])
print("")

print("Quercus has the highest mean DBH")

Mean    23.568238
Name: Quercus, dtype: float64

Mean    18.419085
Name: Acer, dtype: float64

Mean    11.03361
Name: Fraxinus, dtype: float64

Quercus has the highest mean DBH

Q4: How many different species of trees are recorded in the Acer genus?

In [44]:
#will need to operate with the genus and genus_spec i think 
#have not answered yet

Q5:

• Calculate a new column named "pop_M" (population in millions), by transforming the
"pop" (population) column.

• Remove the original "pop" column.

• Choose/subset a city that starts with the same letter as your first name (for example,
"Mexico City" if your first name is Michael).

• Subset the five biggest (i.e., largest population sizes) cities from the country where your selected city is.

• Print the result.

• Make sure you write the scripts in different code cells where you describe the process.

In [55]:
#read in cities dataset 
cities_df = pd.read_csv("Assignment 2 Data/world_cities.csv", sep=",", header=0, encoding="ISO-8859-1")
cities_df.head()

                 city    country    pop    lat    lon  capital
0  'Abasan al-Jadidah  Palestine   5629  31.31  34.34        0
1  'Abasan al-Kabirah  Palestine  18999  31.32  34.35        0
2        'Abdul Hakim   Pakistan  47788  30.55  72.11        0
3  'Abdullah-as-Salam     Kuwait  21817  29.36  47.98        0
4               'Abud  Palestine   2456  32.03  35.07        0

In [56]:
#creating new column called pop_M

cities_df['pop_M'] = cities_df['pop']/1000000
cities_df

,city,country,pop,lat,lon,capital,pop_M
0,'Abasan al-Jadidah,Palestine,5629,31.31,34.34,0,0.005629
1,'Abasan al-Kabirah,Palestine,18999,31.32,34.35,0,0.018999
2,'Abdul Hakim,Pakistan,47788,30.55,72.11,0,0.047788
3,'Abdullah-as-Salam,Kuwait,21817,29.36,47.98,0,0.021817
4,'Abud,Palestine,2456,32.03,35.07,0,0.002456
...,...,...,...,...,...,...,...
43640,az-Zubayr,Iraq,124611,30.39,47.71,0,0.124611
43641,az-Zulfi,Saudi Arabia,54070,26.30,44.80,0,0.054070
43642,az-Zuwaytinah,Libya,21984,30.95,20.12,0,0.021984
43643,s-Gravenhage,Netherlands,479525,52.07,4.30,0,0.479525
43644,s-Hertogenbosch,Netherlands,135529,51.68,5.30,0,0.135529

In [57]:
#remove pop column
cities_df.pop('pop')
cities_df

                     city       country    lat    lon  capital     pop_M
0      'Abasan al-Jadidah     Palestine  31.31  34.34        0  0.005629
1      'Abasan al-Kabirah     Palestine  31.32  34.35        0  0.018999
2            'Abdul Hakim      Pakistan  30.55  72.11        0  0.047788
3      'Abdullah-as-Salam        Kuwait  29.36  47.98        0  0.021817
4                   'Abud     Palestine  32.03  35.07        0  0.002456
...                   ...           ...    ...    ...      ...       ...
43640           az-Zubayr          Iraq  30.39  47.71        0  0.124611
43641            az-Zulfi  Saudi Arabia  26.30  44.80        0  0.054070
43642       az-Zuwaytinah         Libya  30.95  20.12        0  0.021984
43643        s-Gravenhage   Netherlands  52.07   4.30        0  0.479525
43644     s-Hertogenbosch   Netherlands  51.68   5.30        0  0.135529

[43645 rows x 6 columns]

In [60]:
#subset a city beginning with O - Oslo 

city_subset = cities_df.query('city == "Oslo"')
print(city_subset)

       city country    lat    lon  capital     pop_M
27463  Oslo  Norway  59.91  10.75        1  0.821445

In [65]:
#find the 5 cities with the biggest pop_M in Norway

(cities_df.query('country == "Norway"')
 .sort_values(by='pop_M', ascending=[False])
 .head(5))

                    city country    lat    lon  capital     pop_M
27463               Oslo  Norway  59.91  10.75        1  0.821445
4080              Bergen  Norway  60.38   5.34        0  0.214633
36156  Stavanger-Sandnes  Norway  58.97   5.71        0  0.174944
38917          Trondheim  Norway  63.44  10.40        0  0.148492
9789             Drammen  Norway  59.75  10.20        0  0.091451